wegam/STM32F1xWorkSpace/Examples/WOW/AMP01.C
#ifdef AMP01

#include "AMP01.H"

#include "string.h"				//串和内存操作函数头文件
//#include "stm32f10x_dma.h"

#include	"AMP_PHY.H"

#include "STM32F10x_BitBand.H"
#include "STM32_GPIO.H"
#include "STM32_SYS.H"
#include "STM32_SYSTICK.H"
#include "STM32_WDG.H"
#include "STM32_PWM.H"
#include "STM32_USART.H"

#include "SWITCHID.H"

#include 	"CRC.H"




RS485Def stRS485Ly;   //usart2,pa1    //层板接口
RS485Def stRS485Cb;   //uart4,pc12    //副柜接口
SwitchDef stSwitch;

unsigned  char addr2,addr3; //地址
stSysdef  AMP;

unsigned  short testcrc = 0;
unsigned char tetbff[] = { 0x7E,0x07,0x02,0x02,0x01,0x01,0x01,0x01,0x01,0x00,0xA1,0x7F };
unsigned  long*  MCUMEMaddr = (unsigned  long*)(0x1FFFF7E0);
unsigned  short  MCUMEMsize  = 0;
unsigned  short seril=0;
unsigned  char  ackupfarme[]=
{
  0x7E,
  0x02,
  0x81,
  0x00,
  0xB0,
  0x50,
  0x7F
};
unsigned  char  ackdownfarme[]=
{
  0x7E,
  0x02,
  0x01,
  0x00,
  0xD1,
  0x90,
  0x7F
};
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void AMP01_Configuration(void)
{	
  MCUMEMsize  = *MCUMEMaddr;
  testcrc = CRC16_MODBUS(&tetbff[1],8);
  if(0x0100 ==  MCUMEMsize) //256K Flash 柜控制板STM32F103RC
  {
    AMP.Flag.CabBD  = 1;
    AMP.Flag.LayBD  = 0;
    AMP.Flag.SetBD  = 0;
  }
  else if(0x0080 ==  MCUMEMsize) //128K Flash 层控制板STM32F103CB
  {
    AMP.Flag.CabBD  = 0;
    AMP.Flag.LayBD  = 1;
    AMP.Flag.SetBD  = 1;
  }
	SYS_Configuration();					//系统配置---打开系统时钟 STM32_SYS.H	 
	
  IWDG_Configuration(1000);													//独立看门狗配置---参数单位ms
  
  SysTick_Configuration(1000);    //系统嘀嗒时钟配置72MHz,单位为uS
  
  SwitchID_Configuration();
  
  GenyConfiguration();   //常规接口配置，背光，锁，电源控制
    
  COMM_Configuration();  
	
	if(AMP.Flag.CabBD)
	{
		if(AMP.SwData.ID)		//已拨码
			PWM_OUT(TIM2,PWM_OUTChannel1,1,900);						//PWM设定-20161127版本
		else
			PWM_OUT(TIM2,PWM_OUTChannel1,5,900);						//PWM设定-20161127版本
	}
	else
		GPIO_Configuration_OPP50(SYSLEDPort,SYSLEDPin);

  while(1)
  {
    AMP01_Loop();
  }
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void AMP01_Server(void)
{  
	IWDG_Feed();								//独立看门狗喂狗
	
  SwitchID_Server();
  LockServer();
  Tim_Server();
}
/*******************************************************************************
*函数名			:	MainBoard_Server
*功能描述		:	主柜空闲服务程序
              1-查询在线设备
              2-查询副柜有无数据上传
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void AMP01_Loop(void)
{
    if(AMP.Flag.CabBD)  //柜控制板
    {
			if(0  ==  AMP.SwData.ID)		//未拨码
			{
				if(AMP.Time.SYSLEDTime>=500)
				{
					GPIO_Toggle	(BackLightPort,BackLightPin);		//将GPIO相应管脚输出翻转----V20170605
					AMP.Time.SYSLEDTime  = 0;
				}
				return;
			}
    }
    else if(AMP.Flag.LayBD)
    {
				if(AMP.Time.SYSLEDTime%500==0)
				{
					GPIO_Toggle	(SYSLEDPort,SYSLEDPin);		//将GPIO相应管脚输出翻转----V20170605
				}				
    }

  Receive_Server();
  Send_Server();
}

//=================================软件接口ST=============================================================
/*******************************************************************************
*函数名			:	MainBoard_Server
*功能描述		:	主柜空闲服务程序
              1-查询在线设备
              2-查询副柜有无数据上传
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void MainCabinet_IDLEServer(void)
{

}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void Send_Server(void)
{
  if(AMP.Flag.CabBD)//柜控制板
  {
    //----------------PC发送
    if(0  ==  AMP.Time.PcSendTime)
    {
      Check_SendBuff(PcPort);
    }
    //----------------柜发送
    if(0  ==  AMP.Time.CabSendTime)
    {
      Check_SendBuff(CabPort);
    }
    //----------------层发送
    if(0  ==  AMP.Time.LaySendTime)
    {
      Check_SendBuff(LayPort);
    }
    //----------------读卡器发送
    if(0  ==  AMP.Time.CardSendTime)
    {
      Check_SendBuff(CardPort);
    }
  }
  else if(AMP.Flag.LayBD) //层控制板
  {
    //----------------层发送
    if(0  ==  AMP.Time.LaySendTime)
    {
      Check_SendBuff(LayPort);
    }
  }
}

/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned short Check_SendBuff(enCCPortDef Port)
{ 
  unsigned  char  i  = 0;
  unsigned  short  SendLen  = 0;
  unsigned  char  ackflag =0;
  unsigned  char  ackdir =0;
  unsigned  char* SendAddr = NULL;  
  unsigned  char*  ReSendCount;      //PC上传重发计数
  
  unsigned  short*  SendTime=NULL;
  
  stTxdef* Txd  = NULL;
  
  if(LayPort  ==  Port) //层板：需要检查供电有无打开
  {
    if(0  ==  AMP.Flag.LayPownOn) //供电未打开
    {
      return  0;
    }
  }
  
  //------------------------------检查重发
  switch(Port)
  {
    case  NonPort   : return 0;   //不继续执行
    case  PcPort    : ReSendCount = &AMP.ReSend.PcCount;
                      Txd=AMP.buffer.PcTx;    //PC接口发送缓存
                      SendTime  = &AMP.Time.PcSendTime;
                      ackflag = AMP.AckQ.PcAck;
                      ackdir  = AMP.AckQ.PcDir;
      break;
    case  CabPort   : ReSendCount = &AMP.ReSend.CabCount;
                      Txd=AMP.buffer.CabTx;   //柜接口发送缓存
                      SendTime  = &AMP.Time.CabSendTime;
                      ackflag = AMP.AckQ.CabAck;
                      ackdir  = AMP.AckQ.CabDir;
      break;
    case  LayPort   : ReSendCount = &AMP.ReSend.LayCount;
                      Txd=AMP.buffer.LayTx;   //层接口发送缓存
                      SendTime  = &AMP.Time.LaySendTime;
                      ackflag = AMP.AckQ.LayAck;
                      ackdir  = AMP.AckQ.LayDir;
      break;
    case  CardPort  : ReSendCount = &AMP.ReSend.CardCount;
                      Txd=AMP.buffer.CardTx;  //读卡器接口发送缓存
                      SendTime  = &AMP.Time.CardSendTime;
                      ackflag = 0;
      break;
    default :return 0;      //不继续执行 
  }
  if(ackflag) //有应答请求，先应答
  {
    if(ackdir)  //向上应答
      SendLen = HW_SendBuff(Port,ackupfarme,sizeof(ackupfarme));   //返回已发送字节
    else
      SendLen = HW_SendBuff(Port,ackdownfarme,sizeof(ackdownfarme));   //返回已发送字节
    if(SendLen)   //应答发送成功---清除标志请求
    {
      switch(Port)
      {
        case  NonPort   : return 0;   //不继续执行
        case  PcPort    : AMP.AckQ.PcAck = 0;
          break;
        case  CabPort   : AMP.AckQ.CabAck = 0;
          break;
        case  LayPort   : AMP.AckQ.LayAck = 0;
          break;
        case  CardPort  : AMP.AckQ.CardAck  = 0;
          break;
        default :return 0;      //不继续执行 
      }
    }
    *SendTime  = 10;
    return  0;
  }
  if(*SendTime>0)   //不到重发时间，退出
  {
    return  0;
  }
  
  //------------------------------检查发送缓存:先发送排序为1的缓存
  for(i=0;i<arrysize;i++)
  {
    if(1  ==  Txd[i].arry)
    {
      SendAddr  = Txd[i].data;    //起始地址
      SendLen   = Txd[i].size;    //大小
    }
  }
  //-----------------------------有发数据 
  if(NULL!= SendAddr)
  {
    SendLen = HW_SendBuff(Port,SendAddr,SendLen);   //返回已发送字节
    if(SendLen)   //成功发送到缓存
    {
      *ReSendCount +=1;
      *SendTime = ReSendWaitTime;
      
      if(*ReSendCount>=maxresendcount) //超出重发次数：放弃发送
      {
        Releas_OneBuffer(Port);
        *ReSendCount  = 0;      //重发清零
      }
    }
    else
    {
      *SendTime = ReSendWaitTime;
    }
    return  SendLen;
  }
  return  0;
}



