wegam/STM32F1xWorkSpace/Examples/WOW/AMP01.C
  if(0==addr2check(pBuffer,addr2))
    return;
  if(0==addr3check(pBuffer,addr3))
    return;

  
  //-------------------------根据地址转发数据：广播数据发送到副柜和本柜层板
  ampframe  = (stampphydef*)pBuffer;
  Cmd = ampframe->msg.cmd;
  
  //-------------------------下发数据
  if(0  ==  Cmd.dir)
  {
    CMD_Process((unsigned char*)ampframe,framlength);
  }
  //-------------------------上传数据
  else
  {    
    return;   //层板端口只接收下发数据，如有上发数据，则为其它层上传，其它层板不处理
  }
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void CMD_Process(unsigned char* pBuffer,unsigned short length)
{
  unsigned  short datalen     = 0; 
  stampphydef* ampframe       = NULL;
  eucmddef*    cmd  = NULL;
  
  ampframe  = (stampphydef*)pBuffer;
  cmd = (eucmddef*)&ampframe->msg.cmd;
  //---------------------------上位机下发读卡器命令
  if(ICR ==  (*cmd&Down)) //最高位为0表示上往下发
  {
    datalen = ampframe->msg.length-4;   //减一命令位，三地址位长度
    CardPort_Send(ampframe->msg.data,datalen);   //往读卡器接口发数据
    return;
  }
  //---------------------------开锁命令
  if(CTL ==  (*cmd&Down)) //最高位为0表示上往下发
  {
    if(0  ==  ampframe->msg.data[0])    //0为开锁命令
    {
//      UnLock;   //开锁
      AMP.Lock.unlockqust = 1;
      AMP.Lock.reslock    = 0;
    }
    else
    {
//      ResLock;  //释放锁
      AMP.Lock.unlockqust = 0;
      AMP.Lock.reslock    = 1;      
    }
    return;
  }
  //---------------------------开背光灯命令
  if(LED ==  (*cmd&Down)) //最高位为0表示上往下发
  {
    if(AMP.Flag.CabBD)  //柜控制板
    {
      if(0  !=  ampframe->msg.data[0])    //1为开LED
      {
        BackLightOn;   //开LED
      }
      else
      {
        BackLightOff;  //关LED
      }
      return;
    }
    else if(AMP.Flag.LayBD) //层控制板
    {
      PWM_OUT(TIM2,PWM_OUTChannel2,2,1000);						//PWM设定-20161127版本---红色
      PWM_OUT(TIM2,PWM_OUTChannel4,2,1000);						//PWM设定-20161127版本---黄色
      PWM_OUT(TIM2,PWM_OUTChannel3,2,1000);						//PWM设定-20161127版本---蓝色
      
      if(ampframe->msg.data[0]) //红灯
        PWM_OUT(TIM2,PWM_OUTChannel2,2,500);						//PWM设定-20161127版本---红色
      if(ampframe->msg.data[1]) //黄色
        PWM_OUT(TIM2,PWM_OUTChannel4,2,500);						//PWM设定-20161127版本---黄色
      if(ampframe->msg.data[2]) //蓝色
        PWM_OUT(TIM2,PWM_OUTChannel3,2,500);						//PWM设定-20161127版本---蓝色
    }
  }
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	dir:0向下应答，1向上应答
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void ackFrame(enCCPortDef Port,unsigned char dir)
{
  switch(Port)
  {
    case  NonPort   : return;   //不继续执行
    case  PcPort    : AMP.AckQ.PcAck  = 1;
                      AMP.AckQ.PcDir  = dir;
      break;
    case  CabPort   : AMP.AckQ.CabAck  = 1;
                      AMP.AckQ.CabDir  = dir;
      break;
    case  LayPort   : AMP.AckQ.LayAck  = 1;
                      AMP.AckQ.LayDir  = dir;
      break;
    //case  CardPort  : AMP.AckQ.CardAck  = 1;
    //                    AMP.AckQ.CardDir  = dir;
      //break;
    default :return;      //不继续执行 
  }
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned short Releas_OneBuffer(enCCPortDef Port)
{
  unsigned  char  i  = 0;
  stTxdef* Txd  = NULL;
  unsigned  char*  ReSendCount;      //PC上传重发计数
  unsigned  short*  SendTime=NULL;
  
  switch(Port)
  {
    case  NonPort   : return 0;   //不继续执行
    case  PcPort    : ReSendCount = &AMP.ReSend.PcCount;
                      Txd=AMP.buffer.PcTx;    //PC接口发送缓存
                      SendTime  = &AMP.Time.PcSendTime;
      break;
    case  CabPort   : ReSendCount = &AMP.ReSend.CabCount;
                      Txd=AMP.buffer.CabTx;   //柜接口发送缓存
                      SendTime  = &AMP.Time.CabSendTime;
      break;
    case  LayPort   : ReSendCount = &AMP.ReSend.LayCount;
                      Txd=AMP.buffer.LayTx;   //层接口发送缓存
                      SendTime  = &AMP.Time.LaySendTime;
      break;
    case  CardPort  : ReSendCount = &AMP.ReSend.CardCount;
                      Txd=AMP.buffer.CardTx;  //读卡器接口发送缓存
                      SendTime  = &AMP.Time.CardSendTime;
      break;
    default :return 0;      //不继续执行 
  }
  for(i=0;i<arrysize;i++)
  {
    if(Txd[i].arry>0)
    {
      Txd[i].arry--;
      *SendTime  = SendNopTime;   //释放一个缓存后等待SendNopTime时间后再发下一帧
      *ReSendCount  = 0;
    }
  }
  return  0;
}

/*******************************************************************************
*函数名			:	function
*功能描述		:	AddSendData
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned short AddSendBuffer(enCCPortDef Port,unsigned char* pBuffer,unsigned short length)
{
  unsigned  char  i  = 0;
  unsigned  char  lastarry  = 0;
  
  stTxdef* Txd  = NULL;
  
  switch(Port)
  {
    case  NonPort   : return 0;   //不继续执行
    case  PcPort    : Txd=AMP.buffer.PcTx;    //PC接口发送缓存
      break;
    case  CabPort   : Txd=AMP.buffer.CabTx;   //柜接口发送缓存
      break;
    case  LayPort   : Txd=AMP.buffer.LayTx;   //层接口发送缓存
      break;
    case  CardPort  : Txd=AMP.buffer.CardTx;  //读卡器接口发送缓存
      break;
    default :return 0;      //不继续执行 
  }
  //-------------------------给当前待发送队列编号(最尾号)
  for(i=0;i<arrysize;i++)
  {
    if(Txd[i].arry>lastarry)
    {
      lastarry  = Txd[i].arry;
      //---------------------检查发送队列中是否有相同的指令，如果有，则退出
      if(0  ==  memcmp(Txd[i].data,pBuffer,length)) //比较相同
      {
        if(length ==  Txd[i].size)    //待发送长度一样
          return  length;
      }
    }
  }
  if(lastarry>=arrysize)  //缓存满
    return 0;     //不继续执行
  lastarry=lastarry+1;      //最后的队列编号
  //-------------------------将数据存储到空队列
  for(i=0;i<arrysize;i++)
  {
    if(0  ==  Txd[i].arry)  //0编号表示此为空缓存
    {
      memcpy(Txd[i].data,pBuffer,length);
      Txd[i].arry = lastarry;             //此缓存在发送队列中的排序
      Txd[i].size = length; 
      return  length;
    }
  }
  return  0;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	往PC发送消息
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned short PCnet_Send(unsigned char* pBuffer,unsigned short length)
{
  return(AddSendBuffer(PcPort,pBuffer,length));
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	往副柜发送消息
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned short Cabinet_Send(unsigned char* pBuffer,unsigned short length)
{
  return(AddSendBuffer(CabPort,pBuffer,length));
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	往层板发送消息
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned short Laynet_Send(unsigned char* pBuffer,unsigned short length)
{
  if(AMP.Flag.CabBD)  //柜控制板
  {
    if(1  ==  AMP.Lock.lockstd) //锁关状态：未开
    {
//      UnLock;
      AMP.Lock.unlockqust = 1;
      AMP.Lock.reslock    = 0;
//      LayPowerOn;
//      BackLightOn;
    }
    return(AddSendBuffer(LayPort,pBuffer,length));
  }
  else if(AMP.Flag.LayBD) //层控制板
  {
    return(AddSendBuffer(LayPort,pBuffer,length));
  }
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	往读卡器接口发送消息
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned short CardPort_Send(unsigned char* pBuffer,unsigned short length)
{
  return(AddSendBuffer(CardPort,pBuffer,length));
}
//=================================软件接口End=============================================================


//=================================硬件接口ST==============================================================
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void Receive_Server(void)
{
  unsigned short RxNum  = 0;
  unsigned char rxd[256]={0};
  //==========================================================接收查询
  if(AMP.Flag.CabBD)  //柜控制板
  {
    //---------------------PC接口 USART1
    RxNum = USART_ReadBufferIDLE(USART1,rxd);
    if(RxNum)
    {
      Msg_Process(PcPort,rxd,RxNum);                //柜消息处理
    }
    //---------------------副柜接口 UART4
    RxNum = RS485_ReadBufferIDLE(&stRS485Cb,rxd);
    if(RxNum)
    {
      Msg_Process(CabPort,rxd,RxNum);
    }  
    //---------------------层板接口 USART2
    RxNum = RS485_ReadBufferIDLE(&stRS485Ly,rxd);
    if(RxNum)
    {
      Msg_Process(LayPort,rxd,RxNum);              //柜消息处理
    }
    //---------------------读卡器接口 USART3
    RxNum = USART_ReadBufferIDLE(USART3,rxd);
    if(RxNum)
    {
      Msg_Process(CardPort,rxd,RxNum);
    }
  }
  else if(AMP.Flag.LayBD) //层控制板
  {
    //---------------------层板接口 USART2
    RxNum = RS485_ReadBufferIDLE(&stRS485Ly,rxd);
    if(RxNum)
    {
      Msg_Process(LayPort,rxd,RxNum);              //柜消息处理
    }
  }
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned short HW_SendBuff(enCCPortDef Port,unsigned char* pBuffer,unsigned short length)
{ 
  unsigned  short   sendedlen = 0;
  switch(Port)
  {
    case  NonPort   : return 0;   //不继续执行
    case  PcPort    : sendedlen = USART_DMASend(USART1,pBuffer,length);
      break;
    case  CabPort   : sendedlen = RS485_DMASend(&stRS485Cb,pBuffer,length);	//RS485-DMA发送程序
      break;
    case  LayPort   : sendedlen = RS485_DMASend(&stRS485Ly,pBuffer,length);	//RS485-DMA发送程序
      break;
    case  CardPort  : sendedlen = USART_DMASend(USART3,pBuffer,length);
      break;
    default :return 0;      //不继续执行
  }

  return  sendedlen;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void SwitchID_Server(void)
{
  if(AMP.Time.swicthidtime++>2000) //2秒检查一次拨码
  {
    unsigned  char  tempid  = 0;
    unsigned  char* tempbc  = (unsigned  char*)&AMP.SwData;
    AMP.Time.swicthidtime  = 0;
    tempid  = SWITCHID_ReadLeft(&stSwitch);
    if(*tempbc  != tempid)
    {
      *tempbc  = tempid;
//      AMP01_Configuration();    //重新配置控制板
      SwitchID_Configuration();  
      GenyConfiguration();   //常规接口配置，背光，锁，电源控制    
      COMM_Configuration();
			
			if(AMP.Flag.CabBD)	//柜
			{
				if(AMP.SwData.ID)		//已拨码
					PWM_OUT(TIM2,PWM_OUTChannel1,1,900);						//PWM设定-20161127版本
				else
					PWM_OUT(TIM2,PWM_OUTChannel1,5,900);						//PWM设定-20161127版本
			}
    }
  }
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void LockServer(void)
{
  if(AMP.Flag.CabBD)  //柜控制板
  {
    static unsigned  short locktime = 0;

    if(0  ==  AMP.SwData.ID)    //未拨码--自动开锁
    {
      if(GetLockSts)  //如果锁为关闭状态，则开锁
      {
        UnLock;
      }
      else
      {
        ResLock;
      }
      return;
    }
    if(1==AMP.Lock.unlockrun)   //正在执行开锁动作
    {
      if(AMP.Time.LockTime>unlocktime-10)//10ms后开始检查锁状态
      {
        return;
      }
      if(GetLockSts)    //锁未开
      {
        AMP.Lock.lockstd  = 1;
        if(AMP.Time.LockTime==0)//超过开锁时间
        {
          AMP.Lock.unlockrun  = 0;
          AMP.Lock.unlockerr  = 1;
          AMP.Time.LockTime   = 0;
          ResLock;
        }
      }
      else
      {
        AMP.Lock.lockstd    = 0;
        AMP.Lock.unlockrun  = 0;
        AMP.Lock.unlockerr  = 0;
        AMP.Time.LockTime   = 0;
        AMP.Flag.LayPownOn  = 1;
        BackLightOn;      //打开背光
        LayPowerOn;
        ResLock;        
      }      
    }
    if(1==AMP.Lock.unlockqust)  //开锁请求
    {
      AMP.Lock.unlockrun  = 1;
      AMP.Lock.unlockqust = 0;
      AMP.Lock.reslock    = 0;
      AMP.Lock.unlockerr  = 0;
      AMP.Time.LockTime   = unlocktime;
      UnLock;
    }
    
    if(GetLockSts)    //锁未开
    {
      AMP.Lock.lockstd  = 1;
    }
    else
    {
      AMP.Flag.LayPownOn  = 1;
      AMP.Lock.lockstd  = 0;
    }
  }
}
//=================================硬件接口End=============================================================


//=================================配置函数ST==============================================================

